testsrc/main/mondrian/xmla/excel_2000/excel_2000_02_in.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header>
    <BeginSession 
        mustUnderstand="1" 
        xmlns="urn:schemas-microsoft-com:xml-analysis" 
    />
    <NamespaceCompatibility 
        xmlns="http://schemas.microsoft.com/analysisservices/2003/xmla" 
        mustUnderstand="0"
    />
  </Header>
  <Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis">
      <RequestType>DISCOVER_SCHEMA_ROWSETS</RequestType>
      <Restrictions />
      <Properties>
        <PropertyList>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DataSourceInfo>MondrianFoodMart</DataSourceInfo>
          <Catalog>FoodMart</Catalog>
          <Format>Tabular</Format>
        </PropertyList>
      </Properties>
    </Discover>
  </Body>
</Envelope>
