src/main/resources/atscale-small/0002-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <Version xmlns="http://schemas.microsoft.com/analysisservices/2008/engine/100" Sequence="921"/>
  </soap:Header>
  <soap:Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis">
      <RequestType>DISCOVER_PROPERTIES</RequestType>
      <Restrictions>
        <RestrictionList>
          <PropertyName>
            <Value>DbpropMsmdSubqueries</Value>
            <Value>DbpropMsmdOptimizeResponse</Value>
            <Value>DbpropMsmdActivityID</Value>
            <Value>DbpropMsmdCurrentActivityID</Value>
            <Value>ApplicationContext</Value>
          </PropertyName>
        </RestrictionList>
      </Restrictions>
      <Properties>
        <PropertyList/>
      </Properties>
    </Discover>
  </soap:Body>
</soap:Envelope>